---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.UIName
source: html/6c0cdb63-114c-db7e-d4d2-0669f9602cb9.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.UIName Property

The property labeled "UIName" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string UIName { get; }
```

## Remarks
This property is of type "AssetPropertyString".